app/Controllers/Presensi.php

SELECT *
FROM `tbl_presensi`
WHERE `id_siswa` = '1'
AND `tgl_presensi` = '2025-05-06'
 LIMIT 1
INSERT INTO `tbl_presensi` (`id_siswa`, `tgl_presensi`, `jam_in`, `lokasi_in`, `foto_in`) VALUES ('1', '2025-05-06', '23:21:10', '-7.2459781,109.0074517', 'in_1_1746548470.jpg')
---
    public function absenMasuk()
    {
        $id_siswa = session()->get('id_siswa');
        $tanggalHariIni = date('Y-m-d');

        // Cek apakah siswa sudah absen hari ini
        $sudahAbsen = $this->presensiModel
            ->where('id_siswa', $id_siswa)
            ->where('tgl_presensi', $tanggalHariIni)
            ->first();

        if ($sudahAbsen) {
            // Sudah absen, tampilkan halaman 'sudah absen'
            $data = [
                'judul'   => 'Sudah Absen',
                'menu'    => 'presensi',
                'page'    => 'presensi/v_sudah_absen',
                'sekolah' => $this->presensiModel->dataSekolah()
            ];
            return view('v_template_front', $data);
        }

        // Tangkap data dari form
        $lokasi = $this->request->getPost('lokasi');
        $foto   = $this->request->getPost('image');

        // Simpan presensi masuk
        $this->presensiModel->insert([
            'id_siswa'     => $id_siswa,
            'tgl_presensi' => $tanggalHariIni,
            'jam_in'       => date('H:i:s'),
            'lokasi_in'    => $lokasi,
            'foto_in'      => $foto
        ]);