app/Models/ModelHome.php

    public function dataSiswa()
    {
        return $this->db->table('tbl_siswa')
        ->join('tbl_kelas','tbl_kelas.id_kelas=tbl_siswa.id_kelas', 'LEFT')
        ->where(
            'id_siswa', session()->get('id_siswa'))->get()->getRowArray();
---
SELECT *
FROM `tbl_siswa`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas`=`tbl_siswa`.`id_kelas`
WHERE `id_siswa` = '1'