app/Models/ModelPresensi.php

    public function cekPresensi()
    {
        return $this->db->table('tbl_presensi')
        ->where('id_siswa', session()->get('id_siswa'))
        ->where('tgl_presensi', date('Y-m-d'))
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_siswa` = '1'
AND `tgl_presensi` = '2025-05-06'

    public function dataSekolah()
    {
        return $this->db->table('tbl_setting')->where('id_setting', 1)->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id_setting` = 1