app/Models/ModelAdmin.php

    public function dataSetting()
    {
        return $this->db->table('tbl_setting')
        ->where('id_setting', 1)->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id_setting` = 1

    public function updateSetting($data)
    {
        $this->db->table('tbl_setting')
        ->where('id_setting', 1)
        ->update($data);
---
UPDATE `tbl_setting` SET `nama_sekolah` = 'STM TADIKA MESRA', `alamat` = 'Bumiayu', `lokasi_sekolah` = '-7.281809831268037, 109.02503523974217', `radius` = '100'
WHERE `id_setting` = 1