app/Views/v_template_back.php

SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'
---
<?php
    $db = \Config\Database::connect();

    $user = $db->table('tbl_user')->where('id_user', session()->get('id_user'))->get()->getRowArray();